Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/include/pio/pic32ck2051sg00144.h
#define PIN_PB00D_SERCOM7_PAD2                     _UINT32_(32)
#define MUX_PB00D_SERCOM7_PAD2                     _UINT32_(3) 
#define PINMUX_PB00D_SERCOM7_PAD2                  ((PIN_PB00D_SERCOM7_PAD2 << 16) | MUX_PB00D_SERCOM7_PAD2)
#define PORT_PB00D_SERCOM7_PAD2                    (_UINT32_(1) << 0)

#define PIN_PB19D_SERCOM7_PAD2                     _UINT32_(51)
#define MUX_PB19D_SERCOM7_PAD2                     _UINT32_(3) 
#define PINMUX_PB19D_SERCOM7_PAD2                  ((PIN_PB19D_SERCOM7_PAD2 << 16) | MUX_PB19D_SERCOM7_PAD2)
#define PORT_PB19D_SERCOM7_PAD2                    (_UINT32_(1) << 19)

#define PIN_PA05C_SERCOM7_PAD2                     _UINT32_(5) 
#define MUX_PA05C_SERCOM7_PAD2                     _UINT32_(2) 
#define PINMUX_PA05C_SERCOM7_PAD2                  ((PIN_PA05C_SERCOM7_PAD2 << 16) | MUX_PA05C_SERCOM7_PAD2)
#define PORT_PA05C_SERCOM7_PAD2                    (_UINT32_(1) << 5)

#define PIN_PA22C_SERCOM7_PAD2                     _UINT32_(22)
#define MUX_PA22C_SERCOM7_PAD2                     _UINT32_(2) 
#define PINMUX_PA22C_SERCOM7_PAD2                  ((PIN_PA22C_SERCOM7_PAD2 << 16) | MUX_PA22C_SERCOM7_PAD2)
#define PORT_PA22C_SERCOM7_PAD2                    (_UINT32_(1) << 22)

#define PIN_PB01D_SERCOM7_PAD3                     _UINT32_(33)
#define MUX_PB01D_SERCOM7_PAD3                     _UINT32_(3) 
#define PINMUX_PB01D_SERCOM7_PAD3                  ((PIN_PB01D_SERCOM7_PAD3 << 16) | MUX_PB01D_SERCOM7_PAD3)
#define PORT_PB01D_SERCOM7_PAD3                    (_UINT32_(1) << 1)

#define PIN_PB20D_SERCOM7_PAD3                     _UINT32_(52)
#define MUX_PB20D_SERCOM7_PAD3                     _UINT32_(3) 
#define PINMUX_PB20D_SERCOM7_PAD3                  ((PIN_PB20D_SERCOM7_PAD3 << 16) | MUX_PB20D_SERCOM7_PAD3)
#define PORT_PB20D_SERCOM7_PAD3                    (_UINT32_(1) << 20)

#define PIN_PA06C_SERCOM7_PAD3                     _UINT32_(6) 
#define MUX_PA06C_SERCOM7_PAD3                     _UINT32_(2) 
#define PINMUX_PA06C_SERCOM7_PAD3                  ((PIN_PA06C_SERCOM7_PAD3 << 16) | MUX_PA06C_SERCOM7_PAD3)
#define PORT_PA06C_SERCOM7_PAD3                    (_UINT32_(1) << 6)

#define PIN_PA23C_SERCOM7_PAD3                     _UINT32_(23)
#define MUX_PA23C_SERCOM7_PAD3                     _UINT32_(2) 
#define PINMUX_PA23C_SERCOM7_PAD3                  ((PIN_PA23C_SERCOM7_PAD3 << 16) | MUX_PA23C_SERCOM7_PAD3)
#define PORT_PA23C_SERCOM7_PAD3                    (_UINT32_(1) << 23)

/* ========== PORT definition for SPI_IXS peripheral ========== */
#define PIN_PA09J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define MUX_PA09J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define PINMUX_PA09J_SPI_IXS_FSYNC                 ((PIN_PA09J_SPI_IXS_FSYNC << 16) | MUX_PA09J_SPI_IXS_FSYNC)
#define PORT_PA09J_SPI_IXS_FSYNC                   (_UINT32_(1) << 9)

#define PIN_PD06J_SPI_IXS_FSYNC                    _UINT32_(102)
#define MUX_PD06J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define PINMUX_PD06J_SPI_IXS_FSYNC                 ((PIN_PD06J_SPI_IXS_FSYNC << 16) | MUX_PD06J_SPI_IXS_FSYNC)
#define PORT_PD06J_SPI_IXS_FSYNC                   (_UINT32_(1) << 6)

#define PIN_PD13J_SPI_IXS_FSYNC                    _UINT32_(109)
#define MUX_PD13J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define PINMUX_PD13J_SPI_IXS_FSYNC                 ((PIN_PD13J_SPI_IXS_FSYNC << 16) | MUX_PD13J_SPI_IXS_FSYNC)
#define PORT_PD13J_SPI_IXS_FSYNC                   (_UINT32_(1) << 13)

#define PIN_PA11J_SPI_IXS_SCK                      _UINT32_(11)
#define MUX_PA11J_SPI_IXS_SCK                      _UINT32_(9) 
#define PINMUX_PA11J_SPI_IXS_SCK                   ((PIN_PA11J_SPI_IXS_SCK << 16) | MUX_PA11J_SPI_IXS_SCK)
#define PORT_PA11J_SPI_IXS_SCK                     (_UINT32_(1) << 11)

#define PIN_PD10J_SPI_IXS_SCK                      _UINT32_(106)
#define MUX_PD10J_SPI_IXS_SCK                      _UINT32_(9) 
#define PINMUX_PD10J_SPI_IXS_SCK                   ((PIN_PD10J_SPI_IXS_SCK << 16) | MUX_PD10J_SPI_IXS_SCK)
#define PORT_PD10J_SPI_IXS_SCK                     (_UINT32_(1) << 10)

#define PIN_PD14J_SPI_IXS_SCK                      _UINT32_(110)
#define MUX_PD14J_SPI_IXS_SCK                      _UINT32_(9) 
#define PINMUX_PD14J_SPI_IXS_SCK                   ((PIN_PD14J_SPI_IXS_SCK << 16) | MUX_PD14J_SPI_IXS_SCK)
#define PORT_PD14J_SPI_IXS_SCK                     (_UINT32_(1) << 14)

#define PIN_PA12J_SPI_IXS_SDI                      _UINT32_(12)
#define MUX_PA12J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PA12J_SPI_IXS_SDI                   ((PIN_PA12J_SPI_IXS_SDI << 16) | MUX_PA12J_SPI_IXS_SDI)
#define PORT_PA12J_SPI_IXS_SDI                     (_UINT32_(1) << 12)

#define PIN_PD07J_SPI_IXS_SDI                      _UINT32_(103)
#define MUX_PD07J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PD07J_SPI_IXS_SDI                   ((PIN_PD07J_SPI_IXS_SDI << 16) | MUX_PD07J_SPI_IXS_SDI)
#define PORT_PD07J_SPI_IXS_SDI                     (_UINT32_(1) << 7)

#define PIN_PD16J_SPI_IXS_SDI                      _UINT32_(112)
#define MUX_PD16J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PD16J_SPI_IXS_SDI                   ((PIN_PD16J_SPI_IXS_SDI << 16) | MUX_PD16J_SPI_IXS_SDI)
#define PORT_PD16J_SPI_IXS_SDI                     (_UINT32_(1) << 16)

#define PIN_PB00J_SPI_IXS_SDO                      _UINT32_(32)
#define MUX_PB00J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PB00J_SPI_IXS_SDO                   ((PIN_PB00J_SPI_IXS_SDO << 16) | MUX_PB00J_SPI_IXS_SDO)
#define PORT_PB00J_SPI_IXS_SDO                     (_UINT32_(1) << 0)

#define PIN_PD08J_SPI_IXS_SDO                      _UINT32_(104)
#define MUX_PD08J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PD08J_SPI_IXS_SDO                   ((PIN_PD08J_SPI_IXS_SDO << 16) | MUX_PD08J_SPI_IXS_SDO)
#define PORT_PD08J_SPI_IXS_SDO                     (_UINT32_(1) << 8)

#define PIN_PD17J_SPI_IXS_SDO                      _UINT32_(113)
#define MUX_PD17J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PD17J_SPI_IXS_SDO                   ((PIN_PD17J_SPI_IXS_SDO << 16) | MUX_PD17J_SPI_IXS_SDO)
#define PORT_PD17J_SPI_IXS_SDO                     (_UINT32_(1) << 17)

